<a href="https://colab.research.google.com/github/VeraaaaWei/data_analytics/blob/Python/Copy_of_Unit3_Python_Advanced_Pandas_DataWrangling_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment 1 : Python Data Analysis using salaries dataset

# Data Exploration:  This should include summary statistics, means, medians, quartiles, or any other relevant information about the data set.

In [5]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [63]:
df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/Salaries.csv')

**1. Analyze the dataset**
1.Provide your observation and conclusions

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.shape

(397, 7)

In [ ]:
df.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [ ]:
df.tail()

     Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
392         393      Prof          A             33           30  Male  103106
393         394      Prof          A             31           19  Male  150564
394         395      Prof          A             42           25  Male  101738
395         396      Prof          A             25           15  Male   95329
396         397  AsstProf          A              8            4  Male   81035

In [ ]:
df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

# Mean/median of all salaries


1.   Find the Mean and Median of all Salaries
2.  Provide your findings

In [18]:
# Mean of all salaries

df.mean()

Unnamed: 0          199.000000
yrs.since.phd        22.314861
yrs.service          17.614610
salary           113706.458438
dtype: float64

In [19]:
# Median of all salaries
df.median()

Unnamed: 0          199.0
yrs.since.phd        21.0
yrs.service          16.0
salary           107300.0
dtype: float64

# Median salary between gender and/or rank(title) Etc...

Making a new Data Frame that only has the columns 'sex' and 'salary'

In [39]:
df.columns
column_to_be_dropped = ['Unnamed: 0', 'rank', 'discipline', 'yrs.since.phd', 'yrs.service']
new_df = df.drop(column_to_be_dropped, axis = 1)
new_df.tail()

      sex  salary
392  Male  103106
393  Male  150564
394  Male  101738
395  Male   95329
396  Male   81035

Finding the Median salary for all males

In [50]:
new_df['sex'].is_unique

False

In [51]:
new_df3 = new_df[ new_df['sex'] == 'Male']
new_df3.mean()

salary    115090.418994
dtype: float64

Finding the Median salary for all females

In [52]:
new_df2 = new_df[ new_df['sex'] == 'Female']
new_df2.mean()

salary    101002.410256
dtype: float64

Comparing the Mean salary of Males and Females

In [102]:
a = new_df3.mean() - new_df2.mean()
if int(a)>0:
  print('Males have high Mean salary, which is ' + str(int(a)) + ' higher than females.')
else:
  print('Females have high Mean salary, which is ' + str(int(a)) + ' higher than males.')

Males have high Mean salary, which is 14088 higher than females.

In [ ]:
# The difference between mean salaries of male and female

# Data Wrangling – perform some basic transformations on the data

People who have 20 years of experience (Total: 157), (Mean Salary: 122,520.66)

In [87]:
new_df20y = df[ df['yrs.service'] >= 20]
new_df20y

     Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
3             4  Prof          B             45           39  Male  115000
4             5  Prof          B             40           41  Male  141500
6             7  Prof          B             30           23  Male  175000
7             8  Prof          B             45           45  Male  147765
8             9  Prof          B             21           20  Male  119250
..          ...   ...        ...            ...          ...   ...     ...
384         385  Prof          A             27           21  Male  125192
386         387  Prof          A             29           27  Male  139219
388         389  Prof          A             38           36  Male  119450
392         393  Prof          A             33           30  Male  103106
394         395  Prof          A             42           25  Male  101738

[157 rows x 7 columns]

In [88]:
type(new_df20y)

pandas.core.frame.DataFrame

In [89]:
new_df20y.head()

   Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
3           4  Prof          B             45           39  Male  115000
4           5  Prof          B             40           41  Male  141500
6           7  Prof          B             30           23  Male  175000
7           8  Prof          B             45           45  Male  147765
8           9  Prof          B             21           20  Male  119250

In [90]:
new_df20y.tail()

     Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
384         385  Prof          A             27           21  Male  125192
386         387  Prof          A             29           27  Male  139219
388         389  Prof          A             38           36  Male  119450
392         393  Prof          A             33           30  Male  103106
394         395  Prof          A             42           25  Male  101738

In [91]:
new_df20y.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  157.000000     157.000000   157.000000     157.000000
mean   213.286624      34.242038    31.057325  122520.656051
std    116.841173       8.392152     8.633746   29674.689571
min      4.000000      19.000000    20.000000   57800.000000
25%    114.000000      28.000000    23.000000  101036.000000
50%    232.000000      34.000000    30.000000  119450.000000
75%    308.000000      40.000000    37.000000  142500.000000
max    395.000000      56.000000    60.000000  231545.000000

Comparing the salaries of people who have 20+ years of experience vs less than 20 years of experience

In [95]:
new_df20y.columns
column_to_be_dropped1 = ['Unnamed: 0', 'rank', 'discipline', 'yrs.since.phd', 'sex']
new_df20y1 = df.drop(column_to_be_dropped1, axis = 1)
new_df20y1

     yrs.service  salary
0             18  139750
1             16  173200
2              3   79750
3             39  115000
4             41  141500
..           ...     ...
392           30  103106
393           19  150564
394           25  101738
395           15   95329
396            4   81035

[397 rows x 2 columns]

In [115]:
new_df20y1plus = new_df20y1[ new_df20y1['yrs.service'] > 20]
column_to_be_dropped2 = ['yrs.service']
new_df20y11 = new_df20y1plus.drop(column_to_be_dropped2, axis = 1)
new_df20y11
#new_df20y1minus = new_df20y1[ new_df20y1['yrs.service'] < 20]
column_to_be_dropped3 = ['yrs.service']
new_df20y22 = new_df20y1minus.drop(column_to_be_dropped2, axis = 1)
new_df20y22
new_df20y11.mean()

salary    122103.877551
dtype: float64

In [116]:
new_df20y22.mean()

salary    107940.504167
dtype: float64

In [118]:
b = new_df20y11.mean() - new_df20y22.mean()
if int(b)>0:
  print('People who have 20+ years of experiencehave high Mean salary, which is ' + str(int(b)) + ' higher than people less than 20 years of experience.')
else:
  print('People who have 20- years of experiencehave high Mean salary, which is ' + str(int(b)) + ' higher than people more than 20 years of experience.')

People who have 20+ years of experiencehave high Mean salary, which is 14163 higher than people less than 20 years of experience.

People who have salary of greater than or equal to 200,000

Your Findings here...

# Rename values, subset columns, etc

# Create some simple visualizations showing some simple statistics

Your observations from the visuals:

# Draw some conclusions based on the data.  What did you discover?

Based on the analysis performed above, the conclusions are as follows:

Your Findings here...



I also discovered that the -

 Your Findings here...